<?php

declare(strict_types=1);

return [

    'service' => [
        'online' => 'အွန်လိုင်းဝန်ဆောင်မှု',
    ],

    'register' => [
        'success' => 'စာရင်းသွင်းအောင်မြင်ပါပြီ။',
    ],

    'like' => 'လိုက်ခ်အောင်မြင်ပါပြီ။',
    'unlike' => 'အန်လိုက်ခ်အောင်မြင်ပါပြီ။',

    'saved' => [
        'success' => 'အောင်မြင်စွာ သိမ်းဆည်းပြီးပါပြီ။',
        'fail' => 'အောင်မြင်စွာ ပါယ်ဖျက်ပြီးပါပြီ။ ',
    ],

    'update' => [
        'success' => 'အောင်မြင်စွာ အသစ်ပြင်ဆင်မှု ပြီးပါပြီ။',
        'fail' => 'အသစ်ပြင်ဆင်မှု မအောင်မြင်ခဲ့ပါ။',
    ],

    'read' => [
        'success' => 'အောင်မြင်စွာဖတ်ပါပြီးပါပြီ ။',
        'fail' => 'ဖတ်ရှု ခြင်း မအောင်မြင်ပါ။',
    ],

    'delete' => [
        'success' => 'ဖျက်တာ အောင်မြင်ပါတယ်။',
        'fail' => 'ဖျက်တာ မအောင်မြင်ပါတယ်။',
    ],

    'password' => [
        'forgot' => 'ကျွန်တော် တို့ ရဲ့ စနစ် က ခင်ဗျား ရဲ့ အီးမေးလ် လိပ်စာ ကို OTP သင်္ကေတ တစ်ခု ပေး ပို့ လိမ့်မည်။'
    ],

    'logout' => [
        'success' => 'ထွက်ခြင်း အောင်မြင်ပါသည်။',
    ],

    'login' => [

        'success' => 'အကောင့်ဝင်ခြင်း အောင်မြင်ပါပြီ။',

        'fail' => 'အကောင့်ဝင်ခြင်း မအောင်မြင်ပါ။',
    ],

    'otp-resend' => [
        'success' => 'OTP ကုဒ်ကို ပြန်လည်ပေးပို့ခြင်း အောင်မြင်ပါသည်။',
    ],

    'exceptions' => [

        'wrong_password' => 'အသုံးပြုသူအထောက်အထားများ မကိုက်ညီပါ။',

        'verified' => 'သင့်အီးမေးလ်ကို အတည်မပြုရသေးပါ။',

        'invalid_otp' => 'OTP ကုဒ် မကိုက်ညီပါ။',

        'otp_expired' =>   'OTP ကုဒ် သက်တမ်းကုန်သွားပါပြီ။ OTP ကုဒ်အသစ်တစ်ခု တောင်းဆိုပါ။',

        'permission_denied' => 'သင့်တွင် ၎င်းကို အသုံးပြုခွင့်မရှိပါ။',

        'invalid_app_keys' => 'သင့်ကီးများသည် မတိုက်ဆိုင်ပါ။',

        'email_not_verified' => 'ဤအသုံးပြုသူသည် မှတ်ပုံတင်ထားပြီးဖြစ်သော်လည်း အတည်ပြုခြင်းလုပ်ငန်းစဉ်ကို လိုအပ်နေသေးသည်။ ',

        'title' => [

            'outdated' => 'ဒိတ်လွန်သွားသည်။',

            'not_found' => 'မတွေ့ပါ။',

            'unauthenicated' => 'အထောက်အထားမခိုင်လုံပါ။',

            'unauthorized' => 'ခွင့်မပြုပါ။ ',

            'invalid_otp' => 'OTP မမှန်ကန်ပါ။',

            'validation' => 'အတည်ပြုချက် မှားသည်။',

            'delete_location' => 'တည်နေရာကို ဖျက်၍မရပါ။',

            'email_not_verified' => 'အီးမေးလ်ကို အတည်မပြုပါ။ ',
        ],
    ],

    'validation' => [

        'unique' => 'attribute: သည် သီးသန့်ဖြစ်ရပါမည်။',

        'count_gt_5' => 'ဖိုတာအရေအတွက်သည် ၅ခု ဖြစ်ရပါမည်။',
    ],

    'delete_location' => [

        'users_exist' => 'ဤနေရာတွင် အသုံးပြုသူများ ရှိနေသောကြောင့် ၎င်းကို ဖျက်၍မရပါ။',

        'jobs_exist' => 'ဤနေရာတွင် အလုပ်များရှိနေသောကြောင့် ဖျက်၍မရပါ။',
    ],

    'delete_category' => [

        'subcategories_exist' => 'ဤအမျိုးအစားတွင် အမျိုးအစားခွဲများ ရှိနေသောကြောင့် ၎င်းကို ဖျက်၍မရပါ။',
    ],

    'delete_subcategory' => [

        'jobs_exist' => 'ဤအမျိုးအစားခွဲတွင် အလုပ်ရှိနေသောကြောင့် ၎င်းကို ဖျက်၍မရပါ။',
    ],

    'email' => [

        'unique' => 'ဒီအီးမေးလ်က ရှိပြီးသားပါ။',

        'not_exists' => 'အကောင့်တစ်ခု အရင်ဖန်တီးဖို့ လိုပါတယ်။',

        'not_register' => 'အသုံးပြုသူသည် ဤအီးမေးလ်ဖြင့် မှတ်ပုံတင်ထားခြင်းမရှိပါ။'
    ],

    'app-version' => [

        'not_found' => 'အက်ပ်ဗားရှင်း မရှိပါ။',
    ],

    'folder' => [

        'invalid' => 'ဤဖိုင်တွဲ ID သည် မမှန်ကန်ပါ။',

        'not_own' => 'ဤဖိုင်တွဲသည် သင့်အတွက်မဟုတ်ပါ။',
    ],
];
